[
    {
        "url": "https://covers.openlibrary.org/b/id/9251896-L.jpg",
        "title": "Ubik",
        "author": "Philip K. Dick",
        "summary": "Ubik, written in 1966 and published in 1969, is one of Philip K. Dick's masterpieces (The Three Stigmata of Plamer Eldritch is another one). Ubik is the first novel to introduce spiritual elements that will culminate in his last novels VALIS, the Divine Invasion and the Transmigration of Timothy Archer. According to movie industry rumor Ubik could be the next big PKD movie project. Philip K. Dick himself wrote a screenplay for Ubik in 1974 but it was never made into a movie. PKD was hoping that it would by sending 'the novel to the agent of Victoria Principal- whom he revered - in hope that she'd wind up reading it.'(Tim Powers in the introduction to Ubik: The Screenplay). Ubik was expanded and adapted from the short story 'What the Dead Men Say' published in Worlds of Tomorrow in 1964. Ubik is one of the most published books of Philip K Dick in the world."
    },
    {
        "url": "https://covers.openlibrary.org/b/id/11153217-L.jpg",
        "title": "Do Androids Dream of Electric Sheep?",
        "author": "Philip K. Dick",
        "summary": "It was January 2021, and Rick Deckard had a license to kill. Somewhere among the hordes of humans out there, lurked several rogue androids. Deckard's assignment--find them and then...'retire' them. Trouble was, the androids all looked exactly like humans, and they didn't want to be found!"
    },
    {
        "url": "https://covers.openlibrary.org/b/id/10045188-L.jpg",
        "title": "The Man in the High Castle",
        "author": "Philip K. Dick",
        "summary": "The Man in the High Castle is an alternate history novel by American writer Philip K. Dick. Published and set in 1962, the novel takes place fifteen years after an alternative ending to World War II, and concerns intrigues between the victorious Axis Powers—primarily, Imperial Japan and Nazi Germany—as they rule over the former United States, as well as daily life under the resulting totalitarian rule. The Man in the High Castle won the Hugo Award for Best Novel in 1963. Beginning in 2015, the book was adapted as a multi-season TV series, with Dick's daughter, Isa Dick Hackett, serving as one of the show's producers. Reported inspirations include Ward Moore's alternate Civil War history, Bring the Jubilee (1953), various classic World War II histories, and the I Ching (referred to in the novel). The novel features a 'novel within the novel' comprising an alternate history within this alternate history wherein the Allies defeat the Axis (though in a manner distinct from the actual historical outcome)."
    }
]